### NYC High School Data

* https://data.cityofnewyork.us/Education/2012-SAT-Results/f9bf-2cp4

* https://data.cityofnewyork.us/Education/School-District-Breakdowns/g3vh-kbnw

In [1]:
import pandas as pd

In [9]:
sat_df = pd.read_csv('./2012_SAT_Results.csv')

In [11]:
sat_df.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

In [12]:
sat_df.columns

Index(['DBN', 'SCHOOL NAME', 'Num of SAT Test Takers',
       'SAT Critical Reading Avg. Score', 'SAT Math Avg. Score',
       'SAT Writing Avg. Score'],
      dtype='object')

In [14]:
sat_columns = ['dbn', 'name', 'num_test_takers','reading_avg', 'math_avg',
       'writing_score']

In [15]:
sat_df.columns = sat_columns

In [17]:
sat_df.head()

,dbn,name,num_test_takers,reading_avg,math_avg,writing_score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

In [18]:
highschools_df = pd.read_csv('./2019_DOE_High_School_Directory.csv')

In [34]:
highschools_df.columns[:30]

Index(['dbn', 'school_name', 'boro', 'overview_paragraph', 'school_10th_seats',
       'academicopportunities1', 'academicopportunities2',
       'academicopportunities3', 'academicopportunities4',
       'academicopportunities5', 'ell_programs', 'language_classes',
       'advancedplacement_courses', 'diplomaendorsements', 'neighborhood',
       'shared_space', 'campus_name', 'building_code', 'location',
       'phone_number', 'fax_number', 'school_email', 'website', 'subway',
       'bus', 'grades2018', 'finalgrades', 'total_students', 'start_time',
       'end_time'],
      dtype='object')

In [35]:
highschools_df.columns[30:60]

Index(['addtl_info1', 'extracurricular_activities', 'psal_sports_boys',
       'psal_sports_girls', 'psal_sports_coed', 'school_sports',
       'graduation_rate', 'attendance_rate', 'pct_stu_enough_variety',
       'college_career_rate', 'pct_stu_safe', 'girls', 'boys', 'pbat',
       'international', 'specialized', 'transfer', 'ptech', 'earlycollege',
       'geoeligibility', 'school_accessibility_description', 'prgdesc1',
       'prgdesc2', 'prgdesc3', 'prgdesc4', 'prgdesc5', 'prgdesc6', 'prgdesc7',
       'prgdesc8', 'prgdesc9'],
      dtype='object')

In [36]:
highschools_df.columns[60:90]

Index(['prgdesc10', 'directions1', 'directions2', 'directions3', 'directions4',
       'directions5', 'directions6', 'directions7', 'directions8',
       'directions9', 'directions10', 'requirement1_1', 'requirement1_2',
       'requirement1_3', 'requirement1_4', 'requirement1_5', 'requirement1_6',
       'requirement1_7', 'requirement1_8', 'requirement1_9', 'requirement1_10',
       'requirement2_1', 'requirement2_2', 'requirement2_3', 'requirement2_4',
       'requirement2_5', 'requirement2_6', 'requirement2_7', 'requirement2_8',
       'requirement2_9'],
      dtype='object')

In [43]:
highschool_cols = ['dbn', 'school_name', 'boro', 'total_students',
 'graduation_rate', 'attendance_rate', 'college_career_rate']

In [45]:
highschools_df[highschool_cols].head()

,dbn,school_name,boro,total_students,graduation_rate,attendance_rate,college_career_rate
0,16K498,Brooklyn High School for Law and Technology,K,594,0.74,0.85,0.49
1,17K524,International High School at Prospect Heights,K,417,0.63,0.88,0.53
2,02M531,Repertory Company High School for Theatre Arts,M,242,0.96,0.91,0.87
3,05M670,Thurgood Marshall Academy for Learning and Soc...,M,547,0.81,0.91,0.60
4,15K423,Brooklyn Frontiers High School,K,168,NaN,0.76,NaN

In [46]:
highschool_sel_df = highschools_df[highschool_cols]

In [53]:
sat_df[sat_df['dbn'] == '16K498']

,dbn,name,num_test_takers,reading_avg,math_avg,writing_score
293,16K498,BROOKLYN HIGH SCHOOL FOR LAW AND TECHNOLOGY,46,362,372,358

In [54]:
highschool_sel_df.dtypes

dbn                     object
school_name             object
boro                    object
total_students           int64
graduation_rate        float64
attendance_rate        float64
college_career_rate    float64
dtype: object

In [56]:
sat_df.dtypes.to_dict()

{'dbn': dtype('O'),
 'name': dtype('O'),
 'num_test_takers': dtype('O'),
 'reading_avg': dtype('O'),
 'math_avg': dtype('O'),
 'writing_score': dtype('O')}

In [57]:
dict_dtypes = {'dbn': 'object',
 'name': 'object',
 'num_test_takers': 'int64',
 'reading_avg': 'int64',
 'math_avg': 'int64',
 'writing_score': 'int64'}

In [65]:
sat_df.dtypes

dbn                object
name               object
num_test_takers    object
reading_avg        object
math_avg           object
writing_score      object
dtype: object

In [70]:
num_test_takers_ser = pd.to_numeric(sat_df['num_test_takers'], errors = 'coerce')

In [71]:
reading_avg_ser = pd.to_numeric(sat_df['reading_avg'], errors = 'coerce')

In [72]:
math_avg_ser = pd.to_numeric(sat_df['math_avg'], errors = 'coerce')

In [73]:
writing_score_ser = pd.to_numeric(sat_df['writing_score'], errors = 'coerce')

In [74]:
sat_df['num_test_takers'] = num_test_takers_ser
sat_df['reading_avg'] = reading_avg_ser
sat_df['math_avg'] = math_avg_ser
sat_df['writing_score'] = writing_score_ser

In [75]:
sat_df.dtypes

dbn                 object
name                object
num_test_takers    float64
reading_avg        float64
math_avg           float64
writing_score      float64
dtype: object

### Setup databases

In [80]:
import sqlite3
conn = sqlite3.connect('nyc_schools.db')
cursor = conn.cursor()

In [82]:
sat_df.to_sql('sat_records', conn, index = True, index_label = 'id')

In [83]:
highschool_sel_df.to_sql('high_schools', conn, index = True, index_label = 'id')

In [86]:
cursor.execute('PRAGMA table_info(high_schools)')

In [87]:
cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 0),
 (1, 'dbn', 'TEXT', 0, None, 0),
 (2, 'school_name', 'TEXT', 0, None, 0),
 (3, 'boro', 'TEXT', 0, None, 0),
 (4, 'total_students', 'INTEGER', 0, None, 0),
 (5, 'graduation_rate', 'REAL', 0, None, 0),
 (6, 'attendance_rate', 'REAL', 0, None, 0),
 (7, 'college_career_rate', 'REAL', 0, None, 0)]

In [88]:
cursor.execute('select * from high_schools limit 1;')
cursor.fetchall()

[(0,
  '16K498',
  'Brooklyn High School for Law and Technology',
  'K',
  594,
  0.74,
  0.85,
  0.49)]

In [92]:
query = """select * from sat_records join high_schools on sat_records.dbn = high_schools.dbn where high_schools.school_name = 
'Brooklyn High School for Law and Technology' limit 1;"""

cursor.execute(query)

In [93]:
cursor.fetchall()

[(293,
  '16K498',
  'BROOKLYN HIGH SCHOOL FOR LAW AND TECHNOLOGY',
  46.0,
  362.0,
  372.0,
  358.0,
  0,
  '16K498',
  'Brooklyn High School for Law and Technology',
  'K',
  594,
  0.74,
  0.85,
  0.49)]

In [94]:
query = """select * from sat_records join high_schools on sat_records.dbn = high_schools.dbn;"""
cursor.execute(query)

In [95]:
records = cursor.fetchall()

In [98]:
sat_df.columns

Index(['dbn', 'name', 'num_test_takers', 'reading_avg', 'math_avg',
       'writing_score'],
      dtype='object')

In [99]:
highschool_sel_df.columns

Index(['dbn', 'school_name', 'boro', 'total_students', 'graduation_rate',
       'attendance_rate', 'college_career_rate'],
      dtype='object')

In [101]:
records[:1]

[(0,
  '01M292',
  'HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES',
  29.0,
  355.0,
  404.0,
  363.0,
  314,
  '01M292',
  'Orchard Collegiate Academy',
  'M',
  171,
  0.66,
  0.87,
  0.36)]

In [103]:
combined_df = pd.DataFrame(records, columns = ['id', 'dbn', 'name', 'num_test_takers', 'reading_avg', 'math_avg', 'writing_score',
                                'id_2', 'dbn_2', 'school_name', 'boro', 'total_students', 'graduation_rate', 'attendance_rate', 'college_career_rate'
                                ])

In [105]:
combined_df.head(2)

,id,dbn,name,num_test_takers,reading_avg,math_avg,writing_score,id_2,dbn_2,school_name,boro,total_students,graduation_rate,attendance_rate,college_career_rate
0,0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29.0,355.0,404.0,363.0,314,01M292,Orchard Collegiate Academy,M,171,0.66,0.87,0.36
1,1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91.0,383.0,423.0,366.0,68,01M448,University Neighborhood High School,M,465,0.90,0.93,0.70

In [106]:
combined_df.columns

Index(['id', 'dbn', 'name', 'num_test_takers', 'reading_avg', 'math_avg',
       'writing_score', 'id_2', 'dbn_2', 'school_name', 'boro',
       'total_students', 'graduation_rate', 'attendance_rate',
       'college_career_rate'],
      dtype='object')

In [107]:
combined_cols = ['dbn', 'name', 'num_test_takers', 'reading_avg', 'math_avg', 'writing_score', 'boro', 'total_students', 'graduation_rate', 'attendance_rate', 'college_career_rate']

In [109]:
combined_df[combined_cols].head(2)

,dbn,name,num_test_takers,reading_avg,math_avg,writing_score,boro,total_students,graduation_rate,attendance_rate,college_career_rate
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29.0,355.0,404.0,363.0,M,171,0.66,0.87,0.36
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91.0,383.0,423.0,366.0,M,465,0.90,0.93,0.70

In [110]:
selected_combined = combined_df[combined_cols]

In [111]:
conn_single = sqlite3.connect('nyc_schools_single_tb.db')

In [112]:
cursor_single = conn_single.cursor()

In [115]:
selected_combined.to_sql('high_schools', conn_single, index = True, index_label = 'id')

In [117]:
# selected_combined